[Killed] BlockStatement
main/pages/Placeholder/PlaceholderCreatePage.js:3:49
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function PlaceholderCreatePage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>This page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function PlaceholderCreatePage() {}
 
killedBy: PlaceholderCreatePage tests Renders expected content
statusReason: Error: PlaceholderCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
