[Killed] ConditionalExpression
main/components/UCSBDates/UCSBDateForm.js:35:18
 
             <Row>
 
-                {initialUCSBDate && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="UCSBDateForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialUCSBDate.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: UCSBDatesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDateForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/components/UCSBDates/UCSBDateForm.js:35:18
 
             <Row>
 
-                {initialUCSBDate && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="UCSBDateForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialUCSBDate.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialUCSBDate || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="UCSBDateForm-id" id="id" type="text" {...register("id")} value={initialUCSBDate.id} disabled />
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: UCSBDateForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')
