[Killed] BlockStatement
main/pages/Restaurants/RestaurantEditPage.js:53:20
         mutation.mutate(data);
     }
 
-    if (isSuccess) {
-        return <Navigate to="/restaurants" />
-    }
+    if (isSuccess) {}
 
     return (
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/restaurants"}

Number of calls: 0
