[Killed] BlockStatement
main/pages/UCSBDates/UCSBDatesCreatePage.js:36:18
     mutation.mutate(data);
   }
 
-  if (isSuccess) {
-    return <Navigate to="/ucsbdates" />
-  }
+  if (isSuccess) {}
 
   return (
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdates"}

Number of calls: 0
